{
  "projects": {
    "fatigue-plus": {
      "name": "Fatigue+",
      "description": "Fatigue+ is a lightweight, immersive Minecraft mod that simulates sleep deprivation. Designed for Minecraft 1.8.9 (Forge) and built to work client-side only, this mod tracks how long you’ve stayed awake and progressively makes your experience more difficult.",
      "versions": [
        {
          "version": "0.1",
          "releaseDate": "2025-04-21",
          "mcVersion": "1.8.9",
          "type": "major",
          "changes": {
            "added": [
              "Sleep deprivation mechanic with progressive debuffs and death",
              "Client-side mod for Minecraft 1.8.9 using Forge"
            ],
            "changed": [],
            "fixed": [],
            "removed": []
          }
        }
      ]
    },
    "display-api": {
      "name": "Display-API",
      "description": "Display-API is a lightweight, dependency-free API for displaying BossBars, ActionBars, Titles, and Holograms in Minecraft 1.8.9 using native packets.",
      "versions": [
        {
          "version": "1.0.1",
          "releaseDate": "2025-08-01",
          "mcVersion": "1.8.9",
          "type": "patch",
          "changes": {
            "added": [
              "HologramManager and HologramFactory improvements",
              "Support for Animated and Static Holograms via ArmorStands"
            ],
            "changed": [
              "Optimized BossBar packet stability and entity removal logic"
            ],
            "fixed": [
              "Crash when using ActionBar on empty player list"
            ],
            "removed": [
              "GUI API (experimental GUI framework removed for stability)"
            ]
          }
        },
        {
          "version": "1.0",
          "releaseDate": "2025-07-11",
          "mcVersion": "1.8.9",
          "type": "major",
          "changes": {
            "added": [
              "BossBar API with color, style, update, and remove support",
              "ActionBar API with duration and global sending",
              "Title API with fade-in/out and subtitle",
              "GUI API for basic in-game inventory interfaces",
              "Hologram API including static and animated holograms"
            ],
            "changed": [],
            "fixed": [],
            "removed": []
          }
        }
      ]
    },
    "moderation": {
      "name": "Moderation Plugin",
      "description": "A professional Minecraft moderation plugin featuring six punishment commands with multi-language support, Hypixel-inspired messaging, and persistent JSON data storage. Includes customizable language files and detailed staff notifications.",
      "versions": [
        {
          "version": "0.1-beta",
          "releaseDate": "2025-09-05",
          "mcVersion": "1.8.9",
          "type": "major",
          "changes": {
            "added": [
              "Six core punishment commands: /mute, /unmute, /ban, /unban, /tempban, /kick",
              "Multi-language system with English translation (more coming soon)",
              "Per-player language preferences with /language command",
              "Hypixel-inspired message formatting with professional styling",
              "Persistent JSON data storage for punishments and player settings",
              "Detailed staff broadcast notifications with UUIDs, IPs, and ban IDs",
              "Automatic punishment cleanup for expired mutes and temporary bans",
              "Comprehensive punishment tracking with timestamps and staff information"
            ],
            "changed": [],
            "fixed": [],
            "removed": []
          }
        }
      ]
    }
  }
}